In [1]:
import pandas as pd

In [116]:
df = pd.read_html('https://sos.ga.gov/elections/election_results/2010_1130/01050.htm')

In [117]:
df = df[2]

In [118]:
df.shape

(6, 8)

In [119]:
df.head(5)

,0,1,2,3,4,5,6,7
0,NaN,NaN,"Cooke (D) 5,194","Winters (R) 7,682","Totals 12,876",NaN,NaN,NaN
1,NaN,NaN,40.3%,59.7%,100.0%,NaN,NaN,NaN
2,County,PPR,NaN,NaN,NaN,NaN,NaN,NaN
3,BIBB,100%,4392,6261,10653,NaN,NaN,NaN
4,CRAWFORD,100%,300,740,1040,NaN,NaN,NaN

In [120]:
df = df[3:]

In [121]:
df.head(5)

          0     1     2     3      4   5   6   7
3      BIBB  100%  4392  6261  10653 NaN NaN NaN
4  CRAWFORD  100%   300   740   1040 NaN NaN NaN
5     PEACH  100%   502   681   1183 NaN NaN NaN

In [122]:
df = df[df.columns[[0,2,3]]]

In [123]:
df.head(5)

          0     2     3
3      BIBB  4392  6261
4  CRAWFORD   300   740
5     PEACH   502   681

In [124]:
df.columns = ['county', 'David Cooke', 'Greg Winters']

In [125]:
df.tail(5)

     county David Cooke Greg Winters
3      BIBB        4392         6261
4  CRAWFORD         300          740
5     PEACH         502          681

In [126]:
df = df.melt(id_vars=['county'])

In [127]:
df.columns = ['county', 'candidate', 'votes']

In [128]:
df.head()

     county     candidate votes
0      BIBB   David Cooke  4392
1  CRAWFORD   David Cooke   300
2     PEACH   David Cooke   502
3      BIBB  Greg Winters  6261
4  CRAWFORD  Greg Winters   740

In [129]:
df['votes'] = df['votes'].astype(int)

In [130]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   county     6 non-null      object
 1   candidate  6 non-null      object
 2   votes      6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [131]:
# df['office'] = 'Supreme Court Justice'
# df['district'] = ''

# df['office'] = 'Appeals Court Judge'
# df['district'] = ''

# df['office'] = 'Superior Court Judge'
# df['district'] = 'Stone Mountain Circuit'

df['office'] = 'District Attorney'
df['district'] = 'Macon Circuit'

# df['party'] = 'Nonpartisan'
# df['party'] = 'Democrat'
df['party'] = 'Republican'

In [132]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate     party
David Cooke   Republican    5194
Greg Winters  Republican    7682
Name: votes, dtype: int64

In [133]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county             office       district       party     candidate  votes
0      BIBB  District Attorney  Macon Circuit  Republican   David Cooke   4392
1  CRAWFORD  District Attorney  Macon Circuit  Republican   David Cooke    300
2     PEACH  District Attorney  Macon Circuit  Republican   David Cooke    502
3      BIBB  District Attorney  Macon Circuit  Republican  Greg Winters   6261
4  CRAWFORD  District Attorney  Macon Circuit  Republican  Greg Winters    740

In [134]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')